app/views/boards/show.html.erb

<ol id="board_lists">
  <% @board.lists.each do |list| %>
---
SELECT "lists".* FROM "lists" WHERE "lists"."board_id" = ?  [["board_id", 1]]

       <ul class="list_task">
         <% list.sorted_tasks_by_priority.each do |task| %>
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."list_id" = ?  [["list_id", 1]]