app/controllers/boards_controller.rb

INSERT INTO "boards" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Board Three"], ["created_at", "2016-04-06 15:45:56.371082"], ["updated_at", "2016-04-06 15:45:56.371082"]]
---
  def create
    @board = Board.new(board_params)
    if @board.save

SELECT "boards".* FROM "boards" WHERE (name LIKE '%{search_params}%')
---
  def search
    boards = Board.find_boards_by_search(search_params)

SELECT  "boards".* FROM "boards" WHERE "boards"."id" = ? LIMIT 1  [["id", 1]]
---
  def find_board
    @board = Board.find(params[:id])