app/controllers/tasks_controller.rb

INSERT INTO "tasks" ("description", "priority", "list_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["description", "Task Two"], ["priority", "Medium"], ["list_id", 12], ["created_at", "2016-04-06 17:35:51.751986"], ["updated_at", "2016-04-06 17:35:51.751986"]]
---
  def create
    @task = Task.new(task_params)
    @task.list_id = params[:list_id]
    @board = @task.list.board
    if @task.save

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT 1  [["id", 56]]
DELETE FROM "tasks" WHERE "tasks"."id" = ?  [["id", 56]]
---
    task = Task.find(params[:id])
    task_id = task.id
    task.destroy